TOKEN ='5281546341:AAHMShOdATL15BH4kQpgszfop6f8zgLA-Ag'
'5281546341:AAHMShOdATL15BH4kQpgszfop6f8zgLA-Ag-'
dct = {1:['''Здравствуйте, это бот глазной клиники "Ko’z Nuri"😊''',  #0
          'Пожалуйта, введите ваше имя:',  #1
          'Нажмите на кнопку "📞 Поделиться номером"',  #2
          'Нажмите кнопку 👇  🏻 , чтобы зарегистрироваться и получить информацию',  #3
          '📞 Поделиться номером',  #4
          '''Подилитесь контактом☎: ''',  #5
          'Добавлено✅',  #6
          '🛒Корзина',  #7
          'Добро пожаловать',  #8
          '📞Номер телефона',  #9
          'Язык🇷🇺🇺🇿',  #10
          'ГОТОВО✅',  #11
          'Пожалуйста введите ваш отзыв:',  #12
          'Благодарим вас за оставленный отзыв:',  #13
          '⬅️Назад',  #14
          'Выберите',  #15
          '🏠Главное меню',  #16
          '🛍Заказать',  #17
          '🚫Очистить корзину',  #18
          'Стоимость',  #19
          'сум',  #20
          'Пожалуйста, отправьте 📍 локацию:',  #21
          'Отправить локацию📍',  #22
              ' {} уже добавлен в корзину',  #23
              'Выберите или введите количество цифрами:',  #24
              'Пожалуйста, выберите ближаещий филиал:',  #25
              'Выберите день недели:',  # 26
              'Выберите время:',  # 27
              'Выберите способ оплаты:',  #28
              'Введите дату доставки (например: 28 октября):',  # 29
              'Оплата с наличными',  # 30
              'Оплата с карты',  # 31
              '✅✅✅Спасибо за ваш выбор мы записали вас на прием 😊\nЗапись произведена в {} к {}!',  #32
              'Пожалуйста, выберите филиал в котором вы хотите оставить отзыв:',  # 32
              '✅ Совершите оплату в размере стоимости обследование через перевод на номер карту по ниже указанному номеру , чтобы забронировать выбранный вами день, час и пройти обследование: \n\n* Стоимость обследования составляет 100 000 сум *  \n\n\n8600 1204 7966 0659',
              '✅Оплачено✅',
              'Пожалуйста, отправьте скриншот чека об оплате:'
          ],

       2:[
           '''Assalomu aleykum bu Ko’z Nuri Klinika bo’ti 😊''', #0
           'Iltimos, ismingizni kiriting:', #1
           ' "📞 Raqamni ulashish " tugmasini bosing', #2
           'Ro’yxatdan o’tish va ma’lumot olish uchun tugmani bosing 👇🏻', #3
           '📞 Raqamni ulashish ', #4
           '''Kontaktingizni ulashishing☎️: ''', #5
           '''Qo'shildi✅''', #6
           '🛒Korzina', #7
           'Xush kelibsiz', #8
           'Telefon nomer☎️', #9
           'Til🇺🇿🇷🇺', #10
           'TAYYOR✅', #11
           'Fikringizni yozib qoldiring:', #12
           '''Fikringizni bildiganingiz uchun raxmat:''',  # 13
           '⬅️Orqaga', #14
           'Tanlang', #15
           '🏠Asosiy menyu',  # 16
           '🛍Buyurtma berish',#17
           '🚫 Korzinani tozalash',#18
           'Narxi', #19
           "so'm",#20
           'Qaerdasiz 👀? \nAgar lokatsiyangizni📍 yuborsangiz, sizga eng yaqin filialni aniqlaymiz',#21
           'Lokatsiyani yuborish',#22
           '''{}  korzinada mavjud''',#23
           'Sonini tanlang yoki kiriting :',#24
              """Iltimos, eng yaqin filialni tanlang:""",  #25
              'Haftaning kunini tanlang:',  # 26
              """Vaqtni tanlang:""",  # 27
              """To'lov usulini tanlang:""",  #28
              'Yetkazib berish sanasini kiriting (masalan: 28 oktyabr):',  # 29
              """Naqd pul bilan to'lash""",  # 30
              """Kartadan to'lov""",  # 31
              """Tanlovingiz uchun raxmat sizni qabulga yozib qo’ydik 😊 \n Qabul {} kuni soat {}!""",  #32
              """Iltimos, fikringizni bildirmohchi bo'lgan filialimizni tanlang:""",  # 33
              """Tanlagan kuningiz , soatingizni band qilish va ko’rikdan o’tish uchun ushbu karta raqamiga o’tkazmani amalga oshiring ✅: \n\n"Ko’rikdan o’tish narxi 100 ming so’m" \n\n\n8600 1204 7966 0659""",# 34
              """✅To`landi✅""", #35
              """Iltimos, to`lov chekini skrinshotini junating:""" #36

       ]

}

weekdaydct = {
    1:[
        'Понедельник',
        'Вторник',
        'Среда',
        'Четверг',
        'Пятница',
        'Суббота',
    ],
    2:[
        'Dushanba',
        'Seshanba',
        'Chorshanba',
        'Payshanba',
        'Juma',
        'Shanba',
    ]
}

town_hos = {
    1:[
        'г.Ташкент',
        'г.Самарканд',
        'г.Карши',
        'г.Иштихан'

    ],
    2:[
        'Toshkent shaxri',
        'Samarqand shaxri',
        'Qarshi shaxri',
        'Ishtihon shaxri'
    ]
}


towndct = {
    1:{
        'г.Ташкент':["""Глазная Клиника "Ko'z nuri" \nАдрес: г. Ташкент, ул. Мирзо Улугбека, 160 А Буюк Ипак Юли, г. Ташкент, Узбекистан\n\nЛокация: https://goo.gl/maps/aSxvaPrqMydvF3EB6\n\nТел: +998955140333""", 'tash_rus'],
        'г.Самарканд':[""" "Ko'z nuri"\n"Доктор Хикматулло"\nГлазная Клиника. \nАдрес:  г.Самарканд, прекресток Дагбитский\nОриентир: Банковский колледж\n\nЛокация: https://maps.app.goo.gl/6PAb3cwvkdNj1yQ96 \n\n тел:+99895-411-0333 \n+99891-317-0333""", 'samarqand_rus'],
        'г.Карши':["""Глазная клиника "Ko'z nuri" \nАдрес: г. Карши, ул. Ислама Каримова 426 \nОриентир: Отель "Асила", Анхор, Центр "Лондон" o " CUV, маршрут № 1 \n\nЛокация: https://goo.gl/maps/Cnjp1NjFgqSW57V2A\n\nТел: +99890-477-0333 +99890-470-0333
""", 'qarshi_rus'],
        'г.Иштихан':["""Глазная Клиника "Ko'z nuri" \nАдрес: г.Иштихан , ул.Навои, дом №72  \nОриентир: Медицинская ассоциация Иштихана\n\nЛокация: https://goo.gl/maps/C4jyfRsWeXoL7wqM6\n\nТел: +99891 547 03 33\n     +99891 551 03 33""", 'ish_rus']

    },
    2:{
        'Toshkent shaxri':["""Ko’z Nuri  Ko’z klinikasi\nManzil: Toshkent shaxri , Mirzo Ulug’bek tumani , Buyuk Ipak Yo’li ko’chasi , 160 A uy\nMo’ljal :  Salom choyxona\n\nManzil: https://goo.gl/maps/aSxvaPrqMydvF3EB6\n\nTel: +998955140333 +998951940333""", 'tash_uzb'],
        'Samarqand shaxri':[""" "Ko’z nuri"\n"Doctor Xikmatullo" \nKo'z klinikasi.\nManzil:  Samarqand sh. Dagbet ko’chasi 39 uy\n\nMo’ljal: Bank Kollej\n\nManzil: https://maps.app.goo.gl/6PAb3cwvkdNj1yQ96 \n\nTel:+99895-411-0333\n+99891-317-0333""", 'samarqand_uzb'],
        'Qarshi shaxri':[""""Ko’z nuri" ko’z klinikasi\nManzil: Qarshi shaxri Islom Karimov ko'chasi 426 uy \n\nMo’ljal : "Asila"Mexmonxonasi, Anxor, "London" o’quv markazi, 1-marshrut yo'lida\n\nManzil: https://goo.gl/maps/Cnjp1NjFgqSW57V2A\n\nTel: +99890-477-0333 +99890-470-0333""", 'qarshi_rus'],
        'Ishtihon shaxri':["""Ko’z Nuri  Ko’z klinikasi\nManzil: Ishtihon shaxri , Navoi ko’chasi 72 uy .\nMo’ljal : Ishtihon Tibbiyot birlashmasi\n\nManzil: https://goo.gl/maps/C4jyfRsWeXoL7wqM6\n\nTel: +99891 547 03 33\n     +99891 551 03 33""", 'ish_uz']
    }
}





maindct={
    1:[
        '👩🏻‍⚕️Запись на прием к врачу👨🏻‍⚕️',
        '🩺🌐Онлайн-консультация',
        '📺Полезные видеоролики',
        '📍🏥Наши филиалы',
        '⚙️🛠Настройки',
        '📨Оставить отзыв',
    ],
    2:[
        '👩🏻‍⚕️Shifokor qabuliga yozilish👨🏻‍⚕️',
        '🩺🌐Onlayn maslahat',
        '📺Foydali videolar',
        '📍🏥Bizning filiallarimiz',
        '⚙️🛠Sozlamalar',
        '📨Fikr bildirish',
    ]
}


t = {
    '09:00 - 11:00',
    '11:00 - 13:00',
    '13:00 - 15:00',
    '15:00 - 17:00',
    '09:00 - 11:00',
    '11:00 - 13:00',
    '13:00 - 15:00',
}








admdict = [957531477, 1314867567]